<?php

namespace Phpcourse\Myproject\Classes\Controllers;

use Phpcourse\Myproject\Classes\Interfaces\ControllerMethodName;
use Phpcourse\Myproject\Classes\Rendering\Rendering;


class NewsController implements ControllerMethodName
{
    public function index() : void{

        $news = [
            [
                'title' => 'У Польщі розповіли, на яких умовах дозволили транзит сільгосппродукції з України',
                'text' => 'Міністр сільського господарства Польщі Роберт Телус підтвердив досягнення з Україною домовленості про відновлення транзиту сільськогосподарської продукції польською територією – його призупинили разом із забороною на імпорт.

Про це пише "Європейська правда" з посиланням на RMF FM.

За словами Телуса, зернові вантажі з України, які проходять через Польщу, будуть супроводжуватися і контролюватися за допомогою системи SENT, тобто опломбовуватися GPS-трекерами. Це дасть можливість відстежувати їх, щоб зясувати, чи справді вони виїхали з Польщі.

        Польський міністр запевнив, що жодна тонна української сільськогосподарської продукції не залишиться в Польщі. Кожен транспорт буде супроводжуватися конвоєм через Польщу протягом певного часу", – додав він.

        Варшава очікує, що таким чином до липня 2023 року надлишки зерна – близько чотирьох мільйонів тонн – будуть вивезені з Польщі, щоб звільнити місце для нового врожаю.

        Своєю чергою міністр розвитку і технологій Польщі Вальдемар Буда підтвердив, що пропуск сільськогосподарської продукції з України транзитом розпочнеться з опівночі пятниці, 21 квітня. Він наголосив, що після перетину польського кордону вантаж не зможе змінити пункт призначення, "тобто не можна буде зупинитися на будь-якому митному пункті, задекларувати товар і виставити його на ринок".

"Ми зберігаємо заборону на ввезення товарів до Польщі, але дозволяємо проходження товарів через Польщу до чотирьох польських портів і до іншої європейської країни", – уточнив Буда, додавши, що уряд Польщі хоче закріпити це рішення на рівні ЄС.

Українська сторона раніше заявила, що на переговорах у Варшаві вдалось досягти порозуміння щодо транзиту української сільгосппродукції зерна польською територією.

Нагадаємо, наприкінці березня з ініціативи польської сторони Польща, Угорщина, Румунія, Болгарія та Словаччина звернулися до ЄК зі спільним листом, вимагаючи відреагувати на проблеми через експорт українського зерна. 

Останніми днями Польща, Угорщина та Словаччина заборонили імпорт українських сільгосптоварів, у Румунії лунають заклики до цього. При цьому, Варшава спочатку заборонила не лише імпорт, а й транзит сільгосппрродукції з України.',
                'created_at' => 'ВІВТОРОК, 18 КВІТНЯ 2023, 20:57',
            ],
            [
                'title' => 'У Кабміні пояснили, як пенсіонерам отримувати виплати за кордоном',
                'text' => 'Кабінет Міністрів передбачив можливість виплати пенсій українцям, які тимчасово проживають за кордоном, шляхом міжнародного переказу через "Укрпошту".

Про це повідомило Міністерство з питань реінтеграції тимчасово окупованих територій.

Для отримання пенсії постанова передбачає можливість укладення договорів банківського рахунку з українськими банками.

Йдеться про банки, що не мають філій, відділень, представництв у країні проживання пенсіонера, зокрема банки (необанки), які взагалі не мають власної мережі.

Якщо особа бажає отримувати пенсію через банк, заяву про виплату можна буде подати в електронній формі з використанням засобів кваліфікованого електронного підпису. Це можна буде зробити разом із відкриттям банківського рахунку, без необхідності особистого відвідування банку.

Також, за бажанням пенсіонера, виплати можна буде отримувати у відділенні пошти (за наявності технічної можливості АТ "Укрпошта" здійснювати переказ коштів у країну перебування).

"Прийняту урядом постанову розробило Мінсоцполітики за результатами нарад з обговорення проблемних питань українських громадян, які знайшли тимчасовий прихисток у Польщі. Отже, зазначені категорії пенсіонерів зможуть відновити отримання пенсії шляхом надсилання заяви поштою в порядку, визначеному Пенсійним фондом України", – йдеться в повідомленні.',
                'created_at' => 'ВІВТОРОК, 18 КВІТНЯ 2023, 20:39',
            ],
            [
                'title' => 'На Луганщині викрили групу освітян, які впроваджували стандарти освіти РФ у школах',
                'text' => 'На Луганщині викрили пятьох педагогів, які відкрито співпрацювали з ворогом у сфері освіти.

        Їм повідомили про підозру у розповсюджені пропаганди РФ та колабораціонізмі, зазначають у прокуратурі Луганської області.

        Крім того, як з’ясувало слідство, педагоги від початку повномасштабного вторгнення почали впроваджувати російські стандарти освіти у закладах освіти, зокрема у школах.

        Діяльність групи з березня 2022 року і до сьогодні очолює так звана "начальниця управління освіти "адміністрації" Старобільського району "ЛНР", повідомляють у прокуратурі.
        За даними правоохоронців, вона розробила та реалізувала план просування російської пропаганди та прокремлівських наративів. Зокрема, призначила 4 директорів "державних загальноосвітніх установ "ЛНР" у Старобільському районі.

Крім того, усі учасники злочинної групи активно коментують питання освіти та дають інтервю на регіональному телеканалі так званої "ЛНР" – "Луганск 24", а також організовують публічні заходи, де активно підтримують окупаційну владу.

        Правоохоронці виявили, що діяльність незаконних закладів освіти на території регіону підозрювані також висвітлювали на сторінках у соціальних мережах "Вконтакте" та Telegram, на інтернет сторінці "ZOV лнр", на сайті "Міністерства освіти та науки "ЛНР" та "офіційному сайті адміністрації Старобільського району "ЛНР".

        Підозрюваним загрожує до 12 років позбавлення волі.
        Нагадаємо, за січень та лютий 2023 року Служба безпеки України виявила понад 30 освітян-колабораціоністів, які зросійщували учнів.
        ',
                'created_at' => '18 квітня 2023',
            ]
        ];
        new Rendering($news);
    }
}
